#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-s3-bucket.data.aws_iam_policy_document.s3_policy-shunkakinoki will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy-shunkakinoki"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::shunkakinoki.com/*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.aws-s3-bucket.aws_cloudfront_origin_access_identity.origin_access_identity-shunkakinoki will be created
  + resource "aws_cloudfront_origin_access_identity" "origin_access_identity-shunkakinoki" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Some comment"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.aws-s3-bucket.aws_s3_bucket_policy.shunkakinoki-com will be created
  + resource "aws_s3_bucket_policy" "shunkakinoki-com" {
      + bucket = "shunkakinoki.com"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity E140DBIDVLFQ56"
                        }
                      + Resource  = "arn:aws:s3:::shunblog.org/*"
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
